
# Мама розвела цілу оранжерею кактусів, деякі з них були голчасті, а
# решта – голі. Маленька донечка Яринка вирішила, що голки на кактуси
# – це занадто визивно, і тому старанно поголила їх бритвою. Добре, що у
# мами залишився записник, в якому всі кактуси були позначені
# кількістю голочок a1, a2, … , an (голі кактуси були позначені 0). Скількох
# кактусів не торкнулась рука юної перукарки?

kaktus = []

n = int(input("Введіть кількість кактусів: "))
for i in range(n):
    k = int(input(f"Якщо кактус голий 0, це кактус номер {i+1} : "))
    kaktus.append(k)

goli = kaktus.count(0)

print(f"{goli} стільки кактусів неторкнулась бритва ")
