
# Маленький онучок вирішив допомогти бабусі підстригти квіти на її
# дорогоцінному квітнику, зрізавши лише бутони та квітоньки на них. На
# щастя кмітливий хлопчик зрізав лише ті квіти, які були заввишки від h1
# см до h2 см від землі. Скільком квіточкам повезло бути підстриженими,
# якщо висота її у сантиметрах становить a1, a2, … , an?


kvitki = []
pidstrijeni = 0

n = int(input("Введіть кількість квіток: "))
for i in range(n):
    k = int(input(f"Введіть висоту квітки, це квітка номер {i+1} : "))
    kvitki.append(k)

h1 = int(input("мінімальна висота :"))
h2 = int(input("максимальна висота :"))

for height in kvitki:
    if h1<=height<=h2:
        pidstrijeni += 1

print(f"{pidstrijeni} стільки квіток підстригли ")